In [2]:
import pandas as pd
import numpy as np

In [3]:
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.tree import DecisionTreeClassifier

In [4]:
from sklearn.metrics import accuracy_score

from sklearn.compose import ColumnTransformer

In [5]:
df = pd.read_csv('titanic.csv')[['Age','Fare','SibSp','Parch','Survived']]

In [6]:
df

      Age     Fare  SibSp  Parch  Survived
0    22.0   7.2500      1      0         0
1    38.0  71.2833      1      0         1
2    26.0   7.9250      0      0         1
3    35.0  53.1000      1      0         1
4    35.0   8.0500      0      0         0
..    ...      ...    ...    ...       ...
886  27.0  13.0000      0      0         0
887  19.0  30.0000      0      0         1
888   NaN  23.4500      1      2         0
889  26.0  30.0000      0      0         1
890  32.0   7.7500      0      0         0

[891 rows x 5 columns]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Fare      891 non-null    float64
 2   SibSp     891 non-null    int64
 3   Parch     891 non-null    int64
 4   Survived  891 non-null    int64
dtypes: float64(2), int64(3)
memory usage: 34.9 KB

In [8]:
df.describe()

              Age        Fare       SibSp       Parch    Survived
count  714.000000  891.000000  891.000000  891.000000  891.000000
mean    29.699118   32.204208    0.523008    0.381594    0.383838
std     14.526497   49.693429    1.102743    0.806057    0.486592
min      0.420000    0.000000    0.000000    0.000000    0.000000
25%     20.125000    7.910400    0.000000    0.000000    0.000000
50%     28.000000   14.454200    0.000000    0.000000    0.000000
75%     38.000000   31.000000    1.000000    0.000000    1.000000
max     80.000000  512.329200    8.000000    6.000000    1.000000

In [9]:
df.isnull().sum()

Age         177
Fare          0
SibSp         0
Parch         0
Survived      0
dtype: int64

In [10]:
df.dropna(inplace=True)

In [11]:
df

      Age     Fare  SibSp  Parch  Survived
0    22.0   7.2500      1      0         0
1    38.0  71.2833      1      0         1
2    26.0   7.9250      0      0         1
3    35.0  53.1000      1      0         1
4    35.0   8.0500      0      0         0
..    ...      ...    ...    ...       ...
885  39.0  29.1250      0      5         0
886  27.0  13.0000      0      0         0
887  19.0  30.0000      0      0         1
889  26.0  30.0000      0      0         1
890  32.0   7.7500      0      0         0

[714 rows x 5 columns]

In [17]:
df['family'] = df['SibSp'] + df['Parch']

In [19]:
df

      Age     Fare  SibSp  Parch  Survived  family
0    22.0   7.2500      1      0         0       1
1    38.0  71.2833      1      0         1       1
2    26.0   7.9250      0      0         1       0
3    35.0  53.1000      1      0         1       1
4    35.0   8.0500      0      0         0       0
..    ...      ...    ...    ...       ...     ...
885  39.0  29.1250      0      5         0       5
886  27.0  13.0000      0      0         0       0
887  19.0  30.0000      0      0         1       0
889  26.0  30.0000      0      0         1       0
890  32.0   7.7500      0      0         0       0

[714 rows x 6 columns]

In [20]:
df.drop(columns=['SibSp','Parch'],inplace=True)

In [21]:
df.sample()

      Age    Fare  Survived  family
780  13.0  7.2292         1       0

In [22]:
df.sample(6)

      Age     Fare  Survived  family
606  30.0   7.8958         0       0
624  21.0  16.1000         0       0
263  40.0   0.0000         0       0
879  56.0  83.1583         1       1
695  52.0  13.5000         0       0
521  22.0   7.8958         0       0

In [23]:
x = df.drop(columns=['Survived'])

In [24]:
y = df['Survived']

In [25]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [26]:
model = DecisionTreeClassifier()

model.fit(x_train,y_train)

y_pred = model.predict(x_test)

accuracy_score(y_test,y_pred)

0.6363636363636364

In [27]:
np.mean(cross_val_score(DecisionTreeClassifier(),x,y,cv=10,scoring='accuracy'))

0.640121283255086

In [28]:
from sklearn.preprocessing import Binarizer

In [29]:
trf = ColumnTransformer([
    ('bin',Binarizer(copy=False),['family'])
],remainder='passthrough')

In [30]:
x_train_trf = trf.fit_transform(x_train)
x_test_trf = trf.transform(x_test)

In [32]:
pd.DataFrame(x_train_trf,columns=['family','Age','Fare'])

     family   Age      Fare
0       1.0  31.0   20.5250
1       1.0  26.0   14.4542
2       1.0  30.0   16.1000
3       0.0  33.0    7.7750
4       0.0  25.0   13.0000
..      ...   ...       ...
566     1.0  46.0   61.1750
567     0.0  25.0   13.0000
568     0.0  41.0  134.5000
569     1.0  33.0   20.5250
570     0.0  33.0    7.8958

[571 rows x 3 columns]

In [33]:
model2 = DecisionTreeClassifier()
model2.fit(x_train_trf,y_train)
y_pred2 = model2.predict(x_test_trf)

accuracy_score(y_test,y_pred2)

0.6083916083916084

In [35]:
x_trf = trf.fit_transform(x)
np.mean(cross_val_score(DecisionTreeClassifier(),x_trf,y,cv=10,scoring='accuracy'))

0.6303599374021911